Q1. List any five functions of the pandas library with execution.

In [4]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.2-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.manylinux_2_24_x86_64.whl (7.1 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.1/7.1 MB 53.9 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.2
Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
df = pd.read_html('https://github.com/datasciencedojo/datasets/blob/master/titanic.csv', index)

In [5]:
df = df[0]

In [6]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,NaN,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,NaN,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,NaN,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,NaN,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,NaN,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
df.tail()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,NaN,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,NaN,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,NaN,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,NaN,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,NaN,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [8]:
df.describe()

,Unnamed: 0,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,0.0,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,NaN,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,NaN,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,NaN,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,NaN,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,NaN,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,NaN,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,NaN,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
df['Age'].unique()

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [14]:
df['Age'].value_counts

<bound method IndexOpsMixin.value_counts of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64>

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [42]:
df = pd.DataFrame([[7,8,9], [1,2,3], [4, 5, 6]], columns = ['A', 'B', 'C'])

In [43]:
df

   A  B  C
0  7  8  9
1  1  2  3
2  4  5  6

In [44]:
l = len(df['A'])

In [51]:
li = list(range(1, 4*l, 2))

In [52]:
li

[1, 3, 5, 7, 9, 11]

In [53]:
df.reindex(li)

      A    B    C
1   1.0  2.0  3.0
3   NaN  NaN  NaN
5   NaN  NaN  NaN
7   NaN  NaN  NaN
9   NaN  NaN  NaN
11  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [54]:
dict1 = {'Name': ['A', 'B', 'C', 'D'], 'Values' : [1, 2, 3, 4]}
df = pd.DataFrame(dict1)

In [55]:
df

  Name  Values
0    A       1
1    B       2
2    C       3
3    D       4

In [70]:
def sum(df):
    res = 0
    index = 3
    for row, item in df.iterrows():
        res += item.Values
        index -= 1
        if index == 0:
            break
    return res

In [71]:
res = sum(df)

In [72]:
res

6

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [74]:
df1 = ['A mouse', 'Given a Pandas DataFrame', 'write a Python function to create a new column', 'Given a Pandas DataFrame df with a column', 'write a Python function to create a new column  of words in each row of the column']

In [75]:
df1 = pd.DataFrame(df1, columns = ['Text'])

In [76]:
df1

                                                Text
0                                            A mouse
1                           Given a Pandas DataFrame
2     write a Python function to create a new column
3          Given a Pandas DataFrame df with a column
4  write a Python function to create a new column...

In [79]:
df1['Word_Count'] = df1['Text'].str.split(' ').str.len()

In [80]:
df1

                                                Text  Word_Count
0                                            A mouse           2
1                           Given a Pandas DataFrame           4
2     write a Python function to create a new column           9
3          Given a Pandas DataFrame df with a column           8
4  write a Python function to create a new column...          18

Q5. How are DataFrame.size() and DataFrame.shape() different?

size returns only number of rows and shape returns a tuple containing number of rows and columns.

In [83]:
df1.size

10

In [84]:
df1.shape

(5, 2)

Q6. Which function of pandas do we use to read an excel file?

pd.read_excel()

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [85]:
df2 = pd.DataFrame(['km@gmail.com', 'qwerty@bsnl.com'], columns = ['Email'])

In [86]:
df2['Username'] = df2['Email'].apply(lambda x : x.split('@')[0])

In [87]:
df2

             Email Username
0     km@gmail.com       km
1  qwerty@bsnl.com   qwerty

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [92]:
dict2 = {'A' : [4, 5, 6, 7, 8, 9],
        'B' : [1, 2, 3, 4,5, 11],
        'C' : [1, 2, 3, 4,5 ,6]}
df3 = pd.DataFrame(dict2)

In [93]:
df3

   A   B  C
0  4   1  1
1  5   2  2
2  6   3  3
3  7   4  4
4  8   5  5
5  9  11  6

In [97]:
df4 = df3[(df3['A'] > 5) & (df3['B'] < 10)]

In [98]:
df4

   A  B  C
2  6  3  3
3  7  4  4
4  8  5  5

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [99]:
df

  Name  Values
0    A       1
1    B       2
2    C       3
3    D       4

In [100]:
max(df['Values'])

4

In [110]:
mean = df['Values'].mean()
median = df['Values'].median()
std = df['Values'].describe()[2]

In [111]:
print(mean, median, std)

2.5 2.5 1.2909944487358056

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [115]:
import random
dates = pd.date_range('1/1/2021', periods = 120, freq ='d')
sales = random.sample(range(50,500),120)

In [124]:
df5 = pd.DataFrame((zip(dates, sales)), columns = ['Date', 'Sales'])

In [127]:
df5['MovingAverage'] = df5['Sales'].rolling(7).mean()

In [128]:
df5

          Date  Sales  MovingAverage
0   2021-01-01    449            NaN
1   2021-01-02    375            NaN
2   2021-01-03    129            NaN
3   2021-01-04    224            NaN
4   2021-01-05    260            NaN
..         ...    ...            ...
115 2021-04-26     86     305.571429
116 2021-04-27    166     301.857143
117 2021-04-28    376     296.571429
118 2021-04-29    450     300.142857
119 2021-04-30    258     291.142857

[120 rows x 3 columns]

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [130]:

df6 = pd.DataFrame({'Date':['2023-05-01','2023-07-02','2023-01-05']})
df6['Date'] = pd.to_datetime(df6['Date'])

df6['Weekday'] = df6['Date'].dt.day_name()

In [131]:
df6

        Date   Weekday
0 2023-05-01    Monday
1 2023-07-02    Sunday
2 2023-01-05  Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [ ]:
df7 = pd.DataFrame({'Date':['2023-05-01','2023-07-02','2023-01-05']})

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Importing pandas with import pandas as pd